Repository: tondeur-h/traductions-PO
Catalog: translate/gnuchess-6.1.1.*.po
Languages: fr

source: Command 'activate' is currently not supported.
fr: La commande 'activate' n'est pas supportée actuellement.

source: Command 'black' is currently not supported.
fr: La commande 'black' n'est actuellement pas supportée.

source: The syntax to add a new book is: book add file.pgn
fr: La syntaxe pour ajouter une nouvelle librairie est: book add fichier.pgn

source: book is now on
fr: La librairie est active

source: book is now off
fr: La librairie est inactive

source: book is now best
fr: La librairie est la meilleure

source: book is now worst
fr: La librairie est la plus mauvaise

source: book is now random
fr: La librairie est aléatoire

source: Incorrect book option
fr: Option de la librairie incorrecte

source: Search to a depth of %d
fr: Recherche à une profondeur de %d

source: Hashing is on.
fr: Le hachage est actif.

source: Hashing is off.
fr: Le hachage est inactif.

source: Fischer increment of %d seconds
fr: Incrément Fischer de %d secondes

source: Time Control: %d moves in %.2f secs
fr: Contrôle du temps: %d coups par %.2f secondes

source: name - list known players alphabetically
fr: name - liste les joueurs connus alphabétiquement

source: score - list by GNU best result first
fr: score - liste en premier les meilleurs résultats GNU

source: reverse - list by GNU worst result first
fr: reverse - liste en premier les plus mauvais résultats GNU

source: Board is wrong!
fr: Le plateau est incorrect!

source: Error reading file '%s'
fr: Erreur de lecture du fichier '%s'

source: Failed to open %s for writing: %s
fr: Impossible d'ouvrir %s en écriture: %s

source: Could not create logfile, all slots occupied.
fr: Impossible de créer le fichier journal, tous les emplacements occupés.

source: You may consider deleting or renaming your existing logfiles.
fr: Vous devez envisager de supprimer ou renommer vos fichiers journaux existant.

source: Null-move heuristic is on.
fr: Heuristique de coup nul est activée.

source: Null-move heuristic is off.
fr: Heuristique de coup nul est désactivée.

source: Incorrect epd file
fr: Fichier epd incorrect

source: No more moves. Game reached the end.
fr: Plus de coups possible. Le jeu est terminé.

source: Initial position reached. There are no earlier moves.
fr: La position initiale est atteinte. Il n'y a plus de coups précédents.

source: Invalid filename.
fr: Nom de fichier invalide.

source: Graphic mode is enabled.
fr: Le mode graphique est activé.

source: Graphic mode is disabled.
fr: Le mode graphique est désactivé.

source: Command 'random' is currently not supported.
fr: La commande 'random' n'est actuellement pas supportée.

source: my rating = %d, opponent rating = %d
fr: ma note = %d, note de l'adversaire = %d

source: No moves to undo!
fr: Pas de coups à annuler!

source: Save to %s
fr: Sauvegarder vers %s

source: Command 'switch' is currently not supported.
fr: La commande 'switch' n'est actuellement pas supportée.

source: Old TimeLimit = %g
fr: Ancien TimeLimit = %g

source: New TimeLimit = %g
fr: Nouveau TimeLimit = %g

source: Usage: %s [OPTION]...
fr: Utilisation: %s [OPTION]...

source: Play the game of chess
fr: Jouer au jeu d'échec

source: -h, --help display this help and exit
fr: -h, --help affiche cet aide et quitte

source: -v, --version display version information and exit
fr: -v, --version affiche l'information de version et quitte

source: -q, --quiet make the program silent on startup
fr: -q, --quiet rend le programme silencieux à l’exécution

source: --silent same as -q
fr: --silent idem à -q

source: -x, --xboard start in engine mode
fr: -x, --xboard Démarre en mode 'engine'

source: -p, --post start up showing thinking
fr: -p, --post commencer a montrer la réflexion

source: -e, --easy disable thinking in opponents time
fr: -e, --easy désactive la réflexion durant le temps de l'adversaire

source: -m, --manual enable manual mode
fr: -m, --manual active le mode manuelle

source: -u, --uci enable UCI protocol (externally behave as UCI engine)
fr: -u, --uci active le protocole UCI (se comporte vue de l'extérieur comme un moteur UCI)

source: -M size, --memory=size specify memory usage in MB for hashtable
fr: -M taille, --memory=taille spécifie la taille en Mo à utiliser pour la table de hachage

source: -a filename, --addbook=filename compile book.bin from pgn book 'filename'
fr: -a nomfichier, --addbook=nomfichier compile book.bin a partir de la librairie pgn 'nomfichier'

source: -g, --graphic enable graphic mode
fr: -g, --graphic active le mode graphique

source: Options xboard and post are accepted without leading dashes for backward compatibility.
fr: Les options xboard et post sont acceptées sans tiret devant pour rétro compatibilité.

source: Moves are accepted either in standard algebraic notation (SAN) or in coordinate algebraic notation.
fr: Les coups sont acceptés également en notation algébrique standard (NAS) ou en notation de coordonnées algébrique.

source: The file 'gnuchess.ini' allows setting config options. See 'info gnuchess' for details. The file will be looked up in the current directory or, if not found there, in the directory pointed to by environment variable GNUCHESS_PKGDATADIR.
fr: Le fichier 'gnuchess.ini' permet de conserver le réglage des options de configurations. Voir 'info gnuchess' par les détails. Le fichier sera recherché dans le répertoire courant ou, s'il n'est pas trouvé, dans le répertoire pointé par la variable d'environnement GNUCHESS_PKGDATADIR.

source: Report bugs to <bug-gnu-chess@gnu.org>.
fr: Reporter les erreurs vers <bug-gnu-chess@gnu.org>.

source: Invalid move: %s
fr: Coup invalide: %s

source: Command 'white' is currently not supported.
fr: La commande 'white' n'est actuellement pas supportée.

source: My rating = %d
fr: Ma note = %d

source: Opponent rating = %d
fr: Note de l'adversaire = %d

source: time
fr: temps

source: moves
fr: coups

source: No. of moves generated = %ld
fr: No. des coups générés = %ld

source: Command 'show eval/score' is currently not supported.
fr: La commande 'show eval/score' n'est actuellement pas supportée.

source: Command 'show pin' is currently not supported.
fr: La commande 'show pin' n'est actuellement pas supportée.

source: Command 'test' is currently not supported.
fr: La commande 'test' n'est actuellement pas supportée.

source: Quits the program.
fr: Quitter le programme.

source: In analysis mode this stops analysis, otherwise it quits the program.
fr: Dans le mode analyse ceci stop l'analyse, sinon quitte le programme.

source: Produces a help blurb corresponding to this list of commands.
fr: Produit une liste d'aide correspondant à la liste des commandes.

source: add - compiles book.bin from a pgn book file
fr: add - compile le fichier book.bin a partir d'un fichier librairie pgn

source: on - enables use of book (default)
fr: on - active l'utilisation de la librairie (défaut)

source: off - disables use of book
fr: off - désactive l'utilisation de la librairie

source: worst - plays worst move from book
fr: worst - joue le plus mauvais coup à partir de la librairie

source: best - plays best move from book
fr: best - joue le meilleur coup à partir de la librairie

source: prefer - same as 'book on' (default)
fr: prefer - idem à 'book on' (défaut)

source: random - plays any move from book
fr: random - joue n'importe quel coup de la librairie

source: Prints out the version of this program.
fr: Imprime la version de ce programme.

source: Backs up one move in pgn loaded game.
fr: Sauvegarde un coup dans le fichier de jeu pgn chargé.

source: Saves the game so far from memory to the file.
fr: Sauvegarde le jeu jusqu'ici depuis la mémoire vers le fichier.

source: Loads the game in the file into memory.
fr: Charger le jeu depuis le fichier vers la mémoire.

source: Loads the game in the file into memory, and enables the commands 'first', 'last', 'next', 'previous'.
fr: Charge le jeu a partir du fichier vers la mémoire, et active les commandes 'first', 'last', 'next', 'previous'.

source: Advances one move in pgn loaded game.
fr: Avance d'un coup dans le fichier de jeu pgn chargé.

source: Goes to begin position of pgn loaded game.
fr: Aller au début du fichier de jeu pgn chargé.

source: Goes to end position of pgn loaded game.
fr: Aller à la fin du fichier de jeu pgn chargé.

source: Makes the program stop moving. You may now enter moves to reach some position in the future.
fr: Demande au programme de stopper les mouvements. Vous devez entrer les coups maintenant pour atteindre certaines position dans le futur.

source: Program plays white.
fr: Le programme joue les blancs.

source: Program plays black.
fr: Le programme joue les noirs.

source: Computer takes whichever side is on move and begins its thinking immediately.
fr: L'ordinateur prend le camps qui doit jouer et commence sa réflexion immédiatement.

source: Arranges for verbose thinking output showing variation, score, time, depth, etc.
fr: Organise la sortie verbeuse de la réflexion montrant les variantes, score, temps, profondeur, etc.

source: Turns off verbose thinking output.
fr: Arrêter le mode sortie verbeuse de la réflexion.

source: Lets you input your name. Also writes the log.nnn and corresponding game.nnn files. For details please see the auxiliary file format sections.
fr: Vous permet d'introduire votre nom. Également d'écrire les fichiers log.nnn et le fichier game.nnn correspondant. Pour les détails consultez les sections auxiliaires des formats de fichiers.

source: Mostly used by Internet Chess Server.
fr: Principalement utilisé par Internet Chess Server.

source: This command reactivates a game that has been terminated automatically due to checkmate or no more time on the clock. However, it does not alter those conditions. So you would have to undo a move or two, or add time to the clock with 'level' or 'time'.
fr: Cette commande réactive un jeu qui à été arrêté automatiquement par échec et mat où plus de temps à l'horloge. Cependant, elle ne modifie pas ces conditions. Donc vous auriez à annuler un ou deux mouvements, où ajouter du temps à l'horloge avec 'level' où 'time'.

source: Inputs the estimated rating for computer and for its opponent.
fr: Saisie des notes estimées pour l'ordinateur et son adversaire.

source: Sets up a new game (i.e. pieces in original positions).
fr: Paramétrer un nouveau jeu(c'est à dire pièces en position d'origine).

source: Inputs time left in game for computer in hundredths of a second. Mostly used by Internet Chess Server.
fr: Saisir le temps restant de jeu pour l'ordinateur en centième de seconde. Surtout utilisé par Internet Chess Server.

source: on - enables using the memory hash table to speed up search
fr: on - active l'utilisation de la table de hachage en mémoire pour accélérer les recherches

source: off - disables the memory hash table
fr: off - désactive la table de hachage en mémoire

source: Sets the hash table to permit storage of N MB.
fr: Fixer la table de hachage pour permettre le stockage de N Mo.

source: on - enables using the null-move heuristic to speed up search
fr: on - active l'utilisation de l'heuristique coup nul pour accélérer la recherche

source: off - disables using the null-move heuristic
fr: off - désactive l'utilisation de l'heuristique coup nul

source: on - enables use of xboard/winboard
fr: on - permet l'utilisation de xboard/winboard

source: off - disables use of xboard/winboard
fr: off - interdit l'utilisation de xboard/winboard

source: Sets the program to look N ply (half-moves) deep for every search it performs. If there is a checkmate or other condition that does not allow that depth, then it will not be.
fr: Paramétrer le programme pour prendre en compte N trait (demi-coup) de profondeur pour chaque recherche qu'il effectue. Si il y a échec et mat où toute autre condition qui n'autorise pas cette profondeur, il ne fait rien.

source: Sets time control to be MOVES in MINUTES, with each move giving an INCREMENT (in seconds, i.e. a Fischer-style clock).
fr: Affecte le contrôle du temps en MOVES par MINUTES, donnant pour chaque coup un INCREMENT (en secondes, c'est à dire une horloge de style Fischer).

source: Loads a position in EPD format from disk into memory.
fr: Charger une position a partir d'un fichier au format EPD depuis le disque vers la mémoire.

source: Saves game position into EPD format from memory to disk.
fr: Sauvegarde la position du jeu dans le format EPD de la mémoire vers le disque.

source: Switches side to move.
fr: changer le coté du trait.

source: Solves the positions in FILENAME.
fr: Résoudre les positions dans FILENAME.

source: Backs up two moves in game history.
fr: Sauvegarde de deux coups dans l'historique du jeu.

source: Backs up one move in game history.
fr: Sauvegarder un coup dans l'historique du jeu.

source: Displays command line syntax.
fr: Affiche la syntaxe de la ligne de commande.

source: board - displays the current board
fr: board - afficher le plateau courant

source: time - displays the time settings
fr: time - affichage du réglage du temps

source: moves - shows all moves using one call to routine
fr: moves - montre tous les coups à l'aide d'un appel à la routine

source: escape - shows moves that escape from check using one call to routine
fr: escape - montre les coups qui échappent au contrôle utilisant un appel à la routine

source: noncapture - shows non-capture moves
fr: noncapture - affiche les coups non capturés

source: capture - shows capture moves
fr: capture - affiche les coups capturés

source: eval [or score] - shows the evaluation per piece and overall
fr: eval [ou score] - montre l'évaluation par pièce et globale

source: game - shows moves in game history
fr: game - affiche l'historique des coups

source: pin - shows pinned pieces
fr: pin - indique les pièces clouées

source: movelist - reads in an epd file and shows legal moves for its entries
fr: movelist - lit un fichier epd et montre les coups légaux pour ces entrées

source: capture - reads in an epd file and shows legal captures for its entries
fr: capture - lit dans un fichier epd et montre les captures légales pour ces entrées

source: movegenspeed - tests speed of move generator
fr: movegenspeed - tests de rapidité du générateur de coup

source: capturespeed - tests speed of capture move generator
fr: capturespeed - test la rapidité du générateur de capture de coups

source: eval - reads in an epd file and shows evaluation for its entries
fr: eval - Lit dans un fichier epd et affiche l’évaluation pour ces entrées

source: evalspeed - tests speed of the evaluator
fr: evalspeed - test la rapidité de l’évaluateur

source: Shows moves from opening book.
fr: Montre les coups a partir de la librairie d'ouverture.

source: Enables display board in graphic mode.
fr: Autorise l'affichage du plateau en mode graphique.

source: Disables graphic mode and display classical view.
fr: Désactiver le mode graphique et afficher la vue classique.

source: Help for command %s not found
fr: Aide pour cette commande %s non trouvée

source: List of commands: (help COMMAND to get more help)
fr: Liste des commandes: (help COMMAND pour obtenir de l'aide)
